-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Ноя 16 2020 г., 13:03
-- Версия сервера: 10.4.14-MariaDB
-- Версия PHP: 7.4.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `lib`
--

-- --------------------------------------------------------

--
-- Структура таблицы `books`
--

CREATE TABLE `books` (
  `ID` int(11) NOT NULL,
  `Name` varchar(30) NOT NULL,
  `Author` varchar(30) NOT NULL,
  `Genre` varchar(32) NOT NULL,
  `Comment` text DEFAULT NULL,
  `User_id` int(11) DEFAULT NULL,
  `Date_of_issue` date DEFAULT NULL,
  `Inventory_NO` int(11) NOT NULL,
  `Group_ID` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `books`
--

INSERT INTO `books` (`ID`, `Name`, `Author`, `Genre`, `Comment`, `User_id`, `Date_of_issue`, `Inventory_NO`, `Group_ID`) VALUES
(1, 'Война и Мир', 'Л.Н.Толстой', 'Реализм', 'Эту книгу я запомню на всю оставшуюся жизнь.', 1, '2020-11-04', 100003, 0),
(2, 'Отцы и дети', 'Тургенев', 'Реализм', '', 23, '2020-11-03', 100006, 0),
(3, 'Метро', 'Глуховский', 'Фантастика', 'Книга повествующая о жизни людей в метро после Третьей Мировой Войны', NULL, '2020-11-05', 100009, 0),
(4, 'Евгений Онегин', 'Пушкин', 'Классика', '', 2, '2020-11-01', 100012, 0),
(5, 'Катерина', 'Пушкин', 'Поэма', 'Вроде бы книга Пушкина, а знать ее, не знаю', 1, '2020-11-04', 100015, 0),
(6, 'Мертвые Души', 'Гоголь', 'Классика', '', 20, '2020-11-01', 100018, 0),
(7, 'Преступление и Наказание', 'Достоевский', 'Классика', '', 10, '2020-11-01', 100021, 0),
(8, 'Мастер и Маргарита', 'Булгаков', 'Фантастика', '', NULL, '2020-11-05', 100024, 0),
(9, 'Повелитель Мух', 'Селинджер', 'Драма', 'Произведение - есть произведение', NULL, '2020-11-10', 100027, 0),
(13, 'Алые Паруса', 'Александр Грин', 'Повесть-Феерия', 'Книга, предназначенная для учащихся восьмых классов.', NULL, '2020-11-04', 100039, 0),
(14, 'Идиот', 'Достоевский', 'Классика', '', NULL, NULL, 100042, 0),
(17, 'Зеленая миля', 'Стивен Кинг', 'Фантастика', 'Одна из популярнейших книг современности.', NULL, NULL, 100051, 0),
(18, 'Горе от ума', 'Грибоедов', 'Классика', '', NULL, NULL, 100054, 0),
(19, 'Обломов', 'Гончаров', 'Классика', '', NULL, NULL, 100057, 0),
(20, 'Три мушкетера', 'Александр Дюма', 'Классика', '', NULL, NULL, 100060, 0),
(23, 'Герой нашего времени', 'Михаил Лермонтов', 'Классика', '', NULL, '2020-11-10', 100069, 0),
(24, 'Гамлет', 'Уильям Шекспир', 'Классика', '', 14, '2020-11-10', 100072, 0),
(25, 'Мцыри', 'А.П.Чехов', 'Классика', '', NULL, '2020-11-10', 100075, 0),
(26, 'Ася', 'Иван Тургенев', 'Классика', '', NULL, '2020-11-10', 100078, 0),
(27, 'Муму', 'Иван Тургенев', 'Классика', '', NULL, '2020-11-15', 100081, 0),
(28, 'Собачье сердце', 'Булгаков', 'Классика', '', NULL, NULL, 100084, 0),
(29, 'Ревизор', 'Гоголь', 'Классика', '', NULL, NULL, 100087, 0),
(30, 'Робинзон Крузо', 'Даниель Дефо', 'Фантастика', '', NULL, NULL, 100090, 0),
(31, 'Капитанская дочка', 'Пушкин', 'Классика', '', 8, '2020-10-04', 100093, 0),
(32, 'Вишневый сад', 'А.П.Чехов', 'Классика', '', 27, '2020-11-14', 100096, 1),
(33, 'Вишневый сад', 'А.П.Чехов', 'Классика', '', NULL, NULL, 100099, 1),
(34, 'Вишневый сад', 'А.П.Чехов', 'Классика', '', NULL, NULL, 100102, 1),
(35, 'Вишневый сад', 'А.П.Чехов', 'Классика', '', 26, '2020-11-14', 100105, 1),
(36, 'Вишневый сад', 'А.П.Чехов', 'Классика', '', 32, '2020-11-15', 100108, 1),
(37, 'Толстый и тонкий', 'А.П.Чехов', 'Сатирика', '', NULL, NULL, 100111, 0),
(39, 'Хамелеон', 'А.П.Чехов', 'Классика', '', NULL, NULL, 100117, 2),
(41, 'Хамелеон', 'А.П.Чехов', 'Классика', '', NULL, NULL, 100123, 2),
(42, 'Хамелеон', 'А.П.Чехов', 'Классика', '', NULL, NULL, 100126, 2),
(43, 'Хамелеон', 'А.П.Чехов', 'Классика', '', NULL, NULL, 100129, 2),
(44, 'Хамелеон', 'А.П.Чехов', 'Классика', '', NULL, NULL, 100132, 2),
(45, 'Хамелеон', 'А.П.Чехов', 'Классика', '', NULL, NULL, 100135, 2),
(46, 'Моцарт и Сальери', 'Пушкин', 'Трагедия', '', NULL, NULL, 100138, 3),
(47, 'Моцарт и Сальери', 'Пушкин', 'Трагедия', '', NULL, NULL, 100141, 3),
(48, 'Моцарт и Сальери', 'Пушкин', 'Трагедия', '', NULL, NULL, 100144, 3),
(49, 'Моцарт и Сальери', 'Пушкин', 'Трагедия', '', NULL, NULL, 100147, 3),
(50, 'Моцарт и Сальери', 'Пушкин', 'Трагедия', '', NULL, NULL, 100150, 3),
(51, 'Моцарт и Сальери', 'Пушкин', 'Трагедия', '', NULL, NULL, 100153, 3),
(52, 'Моцарт и Сальери', 'Пушкин', 'Трагедия', '', NULL, NULL, 100156, 3),
(53, 'Моцарт и Сальери', 'Пушкин', 'Трагедия', '', NULL, NULL, 100159, 3),
(54, 'Моцарт и Сальери', 'Пушкин', 'Трагедия', '', NULL, NULL, 100162, 3),
(55, 'Недоросль', 'Фонвизин', 'Классика', '', NULL, NULL, 100165, 0),
(56, 'Шинель', 'Гоголь', 'Повесть', '', NULL, '2020-11-14', 100168, 4),
(57, 'Шинель', 'Гоголь', 'Повесть', '', NULL, NULL, 100171, 4),
(58, 'Шинель', 'Гоголь', 'Повесть', '', NULL, NULL, 100174, 4),
(59, 'Шинель', 'Гоголь', 'Повесть', '', NULL, NULL, 100177, 4),
(60, 'Шинель', 'Гоголь', 'Повесть', '', NULL, NULL, 100180, 4),
(61, 'Шинель', 'Гоголь', 'Повесть', '', NULL, NULL, 100183, 4),
(62, 'Шинель', 'Гоголь', 'Повесть', '', NULL, NULL, 100186, 4),
(63, 'Шинель', 'Гоголь', 'Повесть', '', NULL, NULL, 100189, 4),
(64, 'Шинель', 'Гоголь', 'Повесть', '', NULL, NULL, 100192, 4),
(65, 'Шинель', 'Гоголь', 'Повесть', '', NULL, NULL, 100195, 4),
(66, 'Мцыри', 'Лермонтов', 'Поэма', '', NULL, NULL, 100198, 0),
(67, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100201, 5),
(68, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100204, 5),
(69, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100207, 5),
(70, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100210, 5),
(71, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100213, 5),
(72, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100216, 5),
(73, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100219, 5),
(74, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100222, 5),
(75, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100225, 5),
(76, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100228, 5),
(77, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100231, 5),
(78, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100234, 5),
(79, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100237, 5),
(80, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100240, 5),
(81, 'Ромео и Джульетта', 'Шекспир', 'Трагедия', '', NULL, NULL, 100243, 5),
(82, 'Стихотворение', 'Лермонтов', 'Классика', '', NULL, NULL, 100246, 6),
(83, 'Стихотворение', 'Лермонтов', 'Классика', '', NULL, NULL, 100249, 6),
(84, 'Стихотворение', 'Лермонтов', 'Классика', '', NULL, NULL, 100252, 6),
(85, 'Стихотворение', 'Лермонтов', 'Классика', '', NULL, NULL, 100255, 6),
(86, 'Стихотворение', 'Лермонтов', 'Классика', '', NULL, NULL, 100258, 6),
(87, 'Левша', 'Лесков', 'Классика', '', NULL, NULL, 100261, 7),
(88, 'Левша', 'Лесков', 'Классика', '', NULL, NULL, 100264, 7),
(89, 'Левша', 'Лесков', 'Классика', '', NULL, NULL, 100267, 7),
(90, 'Левша', 'Лесков', 'Классика', '', NULL, NULL, 100270, 7),
(91, 'Левша', 'Лесков', 'Классика', '', NULL, NULL, 100273, 7),
(92, 'Левша', 'Лесков', 'Классика', '', NULL, NULL, 100276, 7),
(93, 'Левша', 'Лесков', 'Классика', '', NULL, NULL, 100279, 7),
(94, 'Левша', 'Лесков', 'Классика', '', NULL, NULL, 100282, 7),
(95, 'Левша', 'Лесков', 'Классика', '', NULL, NULL, 100285, 7),
(96, 'Левша', 'Лесков', 'Классика', '', NULL, NULL, 100288, 7),
(97, 'Тарас Бульба', 'Гоголь', 'Повесть', '', NULL, NULL, 100291, 0),
(98, 'Детство', 'Толстой', 'Повесть', '', NULL, NULL, 100294, 8),
(99, 'Детство', 'Толстой', 'Повесть', '', NULL, NULL, 100297, 8),
(100, 'Детство', 'Толстой', 'Повесть', '', NULL, NULL, 100300, 8),
(101, 'Детство', 'Толстой', 'Повесть', '', NULL, NULL, 100303, 8),
(102, 'Детство', 'Толстой', 'Повесть', '', NULL, NULL, 100306, 8),
(103, 'Детство', 'Толстой', 'Повесть', '', NULL, NULL, 100309, 8),
(104, 'Детство', 'Толстой', 'Повесть', '', NULL, NULL, 100312, 8),
(105, 'Детство', 'Толстой', 'Повесть', '', NULL, NULL, 100315, 8),
(106, 'Детство', 'Толстой', 'Повесть', '', NULL, NULL, 100318, 8),
(107, 'Детство', 'Толстой', 'Повесть', '', NULL, NULL, 100321, 8),
(108, 'Сестра Кери', 'Драйзер', 'Роман', '', NULL, NULL, 100324, 9),
(109, 'Сестра Кери', 'Драйзер', 'Роман', '', NULL, NULL, 100327, 9),
(110, 'Сестра Кери', 'Драйзер', 'Роман', '', NULL, NULL, 100330, 9),
(111, 'Сестра Кери', 'Драйзер', 'Роман', '', NULL, NULL, 100333, 9),
(112, 'Сестра Кери', 'Драйзер', 'Роман', '', NULL, NULL, 100336, 9),
(118, 'Портрет Дориана Грея', 'Оскар Уальд', 'Роман', '', NULL, NULL, 100354, 0),
(119, 'Три мушкетера', 'Дюма', 'Роман', 'Одна из книг школьной программы', NULL, NULL, 100357, 10),
(120, 'Три мушкетера', 'Дюма', 'Роман', 'Одна из книг школьной программы', NULL, NULL, 100360, 10),
(121, 'Три мушкетера', 'Дюма', 'Роман', 'Одна из книг школьной программы', NULL, NULL, 100363, 10),
(122, 'Три мушкетера', 'Дюма', 'Роман', 'Одна из книг школьной программы', NULL, NULL, 100366, 10),
(123, 'Три мушкетера', 'Дюма', 'Роман', 'Одна из книг школьной программы', NULL, NULL, 100369, 10),
(124, 'Три мушкетера', 'Дюма', 'Роман', 'Одна из книг школьной программы', NULL, NULL, 100372, 10),
(125, 'Три мушкетера', 'Дюма', 'Роман', 'Одна из книг школьной программы', NULL, NULL, 100375, 10),
(126, 'Три мушкетера', 'Дюма', 'Роман', 'Одна из книг школьной программы', NULL, NULL, 100378, 10),
(127, 'Три мушкетера', 'Дюма', 'Роман', 'Одна из книг школьной программы', NULL, NULL, 100381, 10),
(128, 'Три мушкетера', 'Дюма', 'Роман', 'Одна из книг школьной программы', NULL, NULL, 100384, 10),
(129, 'Дубровский', 'Пушкин', 'Классика', '', NULL, NULL, 200000, 11),
(130, 'Дубровский', 'Пушкин', 'Классика', '', NULL, NULL, 200001, 11),
(131, 'Дубровский', 'Пушкин', 'Классика', '', NULL, NULL, 200002, 11),
(132, 'Дубровский', 'Пушкин', 'Классика', '', NULL, NULL, 200003, 11),
(133, 'Дубровский', 'Пушкин', 'Классика', '', NULL, NULL, 200004, 11),
(134, 'Дубровский', 'Пушкин', 'Классика', '', NULL, NULL, 200005, 11),
(135, 'Дубровский', 'Пушкин', 'Классика', '', NULL, NULL, 200006, 11),
(136, 'Дубровский', 'Пушкин', 'Классика', '', NULL, NULL, 200007, 11),
(137, 'Дубровский', 'Пушкин', 'Классика', '', NULL, NULL, 200008, 11),
(138, 'Дубровский', 'Пушкин', 'Классика', '', NULL, NULL, 200009, 11),
(139, 'Лирика', 'Пушкин', 'Поэзия', '', NULL, NULL, 200010, 12),
(140, 'Лирика', 'Пушкин', 'Поэзия', '', NULL, NULL, 200011, 12),
(141, 'Лирика', 'Пушкин', 'Поэзия', '', NULL, NULL, 200012, 12),
(142, 'Лирика', 'Пушкин', 'Поэзия', '', NULL, NULL, 200013, 12),
(143, 'Лирика', 'Пушкин', 'Поэзия', '', NULL, NULL, 200014, 12),
(144, 'Лирика', 'Пушкин', 'Поэзия', '', NULL, NULL, 200015, 12),
(145, 'Лирика', 'Пушкин', 'Поэзия', '', NULL, NULL, 200016, 12),
(146, 'Лирика', 'Пушкин', 'Поэзия', '', NULL, NULL, 200017, 12),
(147, 'Лирика', 'Пушкин', 'Поэзия', '', NULL, NULL, 200018, 12),
(148, 'Лирика', 'Пушкин', 'Поэзия', '', NULL, NULL, 200019, 12),
(149, 'Гроза', 'Островский', 'Драма', '', NULL, NULL, 100000, 0),
(150, 'Приключение Тома Сойера', 'Марк Твен', 'Роман', '', NULL, NULL, 100001, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `ID` int(11) NOT NULL,
  `Firstname` varchar(30) NOT NULL,
  `Surname` varchar(30) NOT NULL,
  `Lastname` varchar(30) DEFAULT NULL,
  `Class` int(11) NOT NULL,
  `Letter` varchar(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`ID`, `Firstname`, `Surname`, `Lastname`, `Class`, `Letter`) VALUES
(1, 'Павел', 'Горбатюк', 'Викторович', 10, 'Е'),
(2, 'Данил', 'Данилов', 'Даниилович', 5, 'В'),
(3, 'Иван', 'Иванов', 'Павлович', 9, 'В'),
(4, 'Василий', 'Иванов', 'Петрович', 4, 'А'),
(5, 'Николай', 'Кромов', 'Без отчества', 10, 'Б'),
(8, 'Даниел', 'Илле', '', 10, 'Е'),
(9, 'Андрей', 'Кузнецов', 'Васильевич', 2, 'Б'),
(10, 'Григорий', 'Ильин', 'Николаевич', 10, 'В'),
(11, 'Никита', 'Лютков', 'Дмитриевич', 10, 'Е'),
(12, 'Павел', 'Иванов', 'Дмитриевич', 9, 'А'),
(13, 'Евдоким', 'Куликов', 'Миронович', 1, 'Г'),
(14, 'Роман', 'Архипов', 'Алексеевич', 5, 'Я'),
(17, 'Владислав', 'Подкользин', 'Дмитриевич', 10, 'К'),
(18, 'Иван', 'Сидоров', 'Петрович', 7, 'Б'),
(20, 'Евгений', 'Жуков', 'Андреевич', 6, 'В'),
(21, 'Алексей', 'Иванов', 'Николаевич', 7, 'Е'),
(23, 'Ольга', 'Шныгина', 'Валерьевна', 11, 'А'),
(24, 'Сергей', 'Петров', 'Анатольевич', 4, 'В'),
(25, 'Кирилл', 'Кривоухов', 'Прохорович', 3, 'Б'),
(26, 'Осип', 'Герасимов', 'Кириллович', 6, 'К'),
(27, 'Андрей', 'Герасимов', 'Васильевич', 6, 'А'),
(28, 'Алексей', 'Торопов', 'Геннадьевич', 9, 'А'),
(30, 'Даниил', 'Харитонов', '', 10, 'Б'),
(31, 'Сергей', 'Иванов', 'Михайлович', 8, 'К'),
(32, 'Василий', 'Скворцов', 'Андреевич', 2, 'А');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `books`
--
ALTER TABLE `books`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=151;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
